# Assignment 3

**Due Wednesday, October 4, by 11:59 pm**

The cell below defines our utility function query() for SQL queries.

The cell below that eads the contents of six of the database tables into pandas DataFrames.  So, for example, the offices DataFrame contains all the data in the offices table.

**For each exercise I want two solutions: one in SQL and one in pandas.**

In [25]:
import sqlalchemy as sql
import pandas as pd

def query(s):
    try:
        conn = sql.create_engine('mysql+pymysql://student:uncwdsc@localhost/models')
        data = pd.read_sql_query(s,conn)
        data.index += 1
        return data
    finally:
        if conn:
            conn.dispose()

In [26]:
offices = query('select * from offices')
employees = query('select * from employees')
orderdetails = query('select * from orderdetails')
orders = query('select * from orders')
products = query('select * from products')
customers = query('select * from customers')

<img src='../data/ERDiagram.png' width=600px>

1. The products table has a buyPrice, the price the company paid for the product, as well as the manufacturer's suggested retail price (MSRP). Markup values are usually given as percentages, so I will call MSRP divided by the buyPrice times 100 the suggested markup.  For each productLine in the products table find the average suggested markup. For the productLine planes I got an average suggested markup of 183.268776.

In [34]:
#1 - SQL Solution 
q='''

SELECT productLine, AVG(MSRP / buyPrice)*100 AS 'Average Suggested Markup Percent'
FROM products
GROUP BY productLine
;
'''
query(q)

        productLine  Average Suggested Markup Percent
1      Classic Cars                        187.647237
2       Motorcycles                        193.795235
3            Planes                        183.268776
4             Ships                        188.586586
5            Trains                        179.358266
6  Trucks and Buses                        190.534061
7      Vintage Cars                        190.703168

In [50]:
#1 - Pandas Solution

products2 = products

products2['markup'] = (products2.MSRP / products2.buyPrice)*100

products2.groupby('productLine')['markup'].mean()

productLine
Classic Cars        187.647237
Motorcycles         193.795235
Planes              183.268776
Ships               188.586586
Trains              179.358266
Trucks and Buses    190.534061
Vintage Cars        190.703168
Name: markup, dtype: float64

2. For the cities in the offices table, find the number of customers whose sales rep works in that city. List them from largest number of customers to lowest. Tokyo has five customers, and this is the lowest.

In [61]:
#offices - officeCode, city
#employees - employeeNumber, officeCode
#customers - salesRepEmployeeNumber, customerNumber, city


#2 - SQL Solution
q='''
SELECT COUNT(c.customerNumber) AS 'N', o.city
FROM offices AS o
INNER JOIN employees AS e on o.officeCode = e.officeCode
INNER JOIN customers AS c on e.employeeNumber = c.salesRepemployeeNumber
GROUP BY o.city
ORDER BY N DESC
;
'''
query(q)

    N           city
1  29          Paris
2  17         London
3  15            NYC
4  12  San Francisco
5  12         Boston
6  10         Sydney
7   5          Tokyo

In [101]:
#2 - Pandas Solution
merge1 = pd.merge(offices, employees,left_on='officeCode',right_on='officeCode',how='inner')
merge2 = pd.merge(customers, merge1, left_on='salesRepEmployeeNumber', right_on='employeeNumber',how='inner')

merge2.groupby('city_y')['customerNumber'].agg(['count']).sort_values('count', ascending=False)

               count
city_y
Paris             29
London            17
NYC               15
Boston            12
San Francisco     12
Sydney            10
Tokyo              5

3. The company charges less than the MSRP for a product. For products in the productLine 'Classic Cars', find the MSRP and the average of the priceEach in the orderdetails table.  The 1949 Jaguar XK 120 has MSRP 90.87 and average price 80.7284.

In [6]:
#products - productLine, MSRP, productCode
#orderDetails - priceEach, productCode

#3 - SQL Solution
q='''

SELECT p.productName, p.MSRP, AVG(o.priceEach)
FROM orderdetails AS o
INNER JOIN products AS p ON o.productCode = p.productCode
WHERE p.productLine = 'Classic Cars'
GROUP BY o.productCode
;
'''
query(q)

                            productName    MSRP  AVG(o.priceEach)
1              1952 Alpine Renault 1300  214.30        197.309286
2                   1972 Alfa Romeo GTA  136.00        124.245714
3                1962 LanciaA Delta 16V  147.74        131.806071
4                     1968 Ford Mustang  194.57        172.446296
5                     2001 Ferrari Enzo  207.80        187.096667
6                    1969 Corvair Monza  151.08        137.763704
7                    1968 Dodge Charger  117.44        106.652963
8                      1969 Ford Falcon  173.02        158.218889
9               1970 Plymouth Hemi Cuda   79.80         70.785926
10                   1969 Dodge Charger  115.16        103.814815
11                      1993 Mazda RX-7  141.54        121.305556
12                1965 Aston Martin DB5  124.44        111.697600
13          1948 Porsche 356-A Roadster   77.00         68.530000
14                     1995 Honda Civic  142.25        129.396667
15       1998 Chrysler Plymouth Prowler  163.73        144.142857
16         1999 Indy 500 Monte Carlo SS  132.00        118.377600
17          1992 Ferrari 360 Spider red  169.34        152.342830
18                 1969 Dodge Super Bee   80.41         70.820000
19                1976 Ford Gran Torino  146.99        132.507778
20       1948 Porsche Type 356 Roadster  141.28        129.073600
21                1970 Triumph Spitfire  143.62        129.046667
22            1957 Corvette Convertible  148.80        129.290741
23                1957 Ford Thunderbird   71.27         65.390000
24           1970 Chevy Chevelle SS 454   73.49         66.672000
25                   1970 Dodge Coronet   57.80         51.235714
26            1966 Shelby Cobra 427 S/C   50.31         45.722000
27                   1949 Jaguar XK 120   90.87         80.728400
28  1958 Chevy Corvette Limited Edition   35.36         32.063571
29                    1952 Citroen-15CV  117.44        107.995417
30              1982 Lamborghini Diablo   37.76         33.942593
31            1969 Chevrolet Camaro Z28   85.61         77.288000
32            1971 Alpine Renault 1600s   61.23         54.132593
33                  2002 Chevy Corvette  107.08         97.614800
34              1956 Porsche 356A Coupe  140.43        128.259259
35    1992 Porsche Cayenne Turbo Silver  118.28        107.679259
36                1961 Chevrolet Impala   80.84         73.265556
37                      1982 Camaro Z28  101.15         89.408929

In [118]:
#3 - Pandas Solution

merge3 = pd.merge(products,orderdetails,left_on='productCode',right_on='productCode',how='inner')
merge3[merge3.productLine == 'Classic Cars'].groupby('productName')[['MSRP', 'priceEach']].mean()

                                       MSRP   priceEach
productName
1948 Porsche 356-A Roadster           77.00   68.530000
1948 Porsche Type 356 Roadster       141.28  129.073600
1949 Jaguar XK 120                    90.87   80.728400
1952 Alpine Renault 1300             214.30  197.309286
1952 Citroen-15CV                    117.44  107.995417
1956 Porsche 356A Coupe              140.43  128.259259
1957 Corvette Convertible            148.80  129.290741
1957 Ford Thunderbird                 71.27   65.390000
1958 Chevy Corvette Limited Edition   35.36   32.063571
1961 Chevrolet Impala                 80.84   73.265556
1962 LanciaA Delta 16V               147.74  131.806071
1965 Aston Martin DB5                124.44  111.697600
1966 Shelby Cobra 427 S/C             50.31   45.722000
1968 Dodge Charger                   117.44  106.652963
1968 Ford Mustang                    194.57  172.446296
1969 Chevrolet Camaro Z28             85.61   77.288000
1969 Corvair Monza                   151.08  137.763704
1969 Dodge Charger                   115.16  103.814815
1969 Dodge Super Bee                  80.41   70.820000
1969 Ford Falcon                     173.02  158.218889
1970 Chevy Chevelle SS 454            73.49   66.672000
1970 Dodge Coronet                    57.80   51.235714
1970 Plymouth Hemi Cuda               79.80   70.785926
1970 Triumph Spitfire                143.62  129.046667
1971 Alpine Renault 1600s             61.23   54.132593
1972 Alfa Romeo GTA                  136.00  124.245714
1976 Ford Gran Torino                146.99  132.507778
1982 Camaro Z28                      101.15   89.408929
1982 Lamborghini Diablo               37.76   33.942593
1992 Ferrari 360 Spider red          169.34  152.342830
1992 Porsche Cayenne Turbo Silver    118.28  107.679259
1993 Mazda RX-7                      141.54  121.305556
1995 Honda Civic                     142.25  129.396667
1998 Chrysler Plymouth Prowler       163.73  144.142857
1999 Indy 500 Monte Carlo SS         132.00  118.377600
2001 Ferrari Enzo                    207.80  187.096667
2002 Chevy Corvette                  107.08   97.614800

4. For each employee who is a sales rep for a customer, find the first and last names and the number of orders their customers have made. Order them by number of orders, high to low.  Barry Jones is in fourth place with 25 orders.

**Hint:** For the pandas solution, I first did the merges, then I added a column called fullName that had firstName + ' ' + lastName.

In [69]:
# employees - employeeNumber, lastName, firstName
# customers - salesRepEmployeeNumber, customerNumber
# orders - customerNumber, orderNumber
# orderdetails - quantityOrdered, orderNumber

#4 - SQL Solution 
q='''

SELECT e.firstName, e.lastName, COUNT(o.orderNumber)
FROM employees AS e
INNER JOIN customers AS c ON e.employeeNumber = c.salesRepEmployeeNumber
INNER JOIN orders AS o ON c.customerNumber = o.customerNumber
GROUP BY c.salesRepEmployeeNumber
ORDER BY COUNT(o.orderNumber) DESC

'''
query(q)

   firstName   lastName  COUNT(o.orderNumber)
1     Gerard  Hernandez                    43
2     Leslie   Jennings                    34
3     Pamela   Castillo                    31
4      Barry      Jones                    25
5     George     Vanauf                    22
6      Larry       Bott                    22
7       Loui     Bondur                    20
8       Andy     Fixter                    19
9      Peter      Marsh                    19
10     Steve  Patterson                    18
11  Foon Yue      Tseng                    17
12      Mami      Nishi                    16
13    Leslie   Thompson                    14
14     Julie   Firrelli                    14
15    Martin     Gerard                    12

In [173]:
#4 - Pandas Solution
merge4 = pd.merge(customers,employees,left_on='salesRepEmployeeNumber',right_on='employeeNumber',how='inner')
merge5 = pd.merge(orders,merge4,left_on='customerNumber',right_on='customerNumber',how='inner')
merge5['Full Name']=merge5['firstName']+ ' ' + merge5['lastName']
merge5.groupby('Full Name')['orderNumber'].count()

Full Name
Andy Fixter         19
Barry Jones         25
Foon Yue Tseng      17
George Vanauf       22
Gerard Hernandez    43
Julie Firrelli      14
Larry Bott          22
Leslie Jennings     34
Leslie Thompson     14
Loui Bondur         20
Mami Nishi          16
Martin Gerard       12
Pamela Castillo     31
Peter Marsh         19
Steve Patterson     18
Name: orderNumber, dtype: int64